Revit 2027 API
BuiltInFailures.AutoRouteFailures.NoValidSolutionAtSelectedPoint Property
 No valid auto-route solution at selected point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoValidSolutionAtSelectedPoint { get; }
Public Shared ReadOnly Property NoValidSolutionAtSelectedPoint As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoValidSolutionAtSelectedPoint {
	FailureDefinitionId^ get ();
}
static member NoValidSolutionAtSelectedPoint : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace